In [77]:
import mysql.connector as sql

In [78]:
db = sql.connect(host='localhost', port=3306, user ='root', password ='root', database='school')

In [79]:
cur=db.cursor()

In [80]:
cur.execute('show databases')

In [81]:
for i in cur :
    print(i)

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('school',)
('sys',)
('world',)

In [82]:
cur.execute('show tables')

In [83]:
for i in cur:
    print(i)

('college',)
('countries',)
('datetime',)
('event',)
('hostal',)
('hostal1',)
('student',)

In [84]:
cur.execute('select * from student')

In [85]:
for i in cur:
    print(i)

(1, 'Puneet kumar', 5000000.0)
(2, 'Pawan', 20.0)
(3, 'Prabhat kumar', 50.0)
(4, 'Ajeet Kumar', 200.0)
(5, 'Deepak Kumar', 300.0)
(6, 'Anurag Nishad', 3000.0)
(7, 'Raj', 200000.0)
(10, 'sonu', None)
(11, None, None)
(12, None, None)
(13, None, None)
(14, None, None)
(16, 'Sunil', None)
(17, 'deepa', 100200.0)

In [86]:
#a = "insert into student values (17,'deepa', 100200)"

In [87]:
#cur.execute(a)

In [88]:
cur.execute("select * from student")

In [89]:
for i in cur:
    print(i)

(1, 'Puneet kumar', 5000000.0)
(2, 'Pawan', 20.0)
(3, 'Prabhat kumar', 50.0)
(4, 'Ajeet Kumar', 200.0)
(5, 'Deepak Kumar', 300.0)
(6, 'Anurag Nishad', 3000.0)
(7, 'Raj', 200000.0)
(10, 'sonu', None)
(11, None, None)
(12, None, None)
(13, None, None)
(14, None, None)
(16, 'Sunil', None)
(17, 'deepa', 100200.0)

In [90]:
a = "update student set name = 'sonu' where sn = 10 "
cur.execute(a)

In [91]:
cur.execute("select * from student")

In [92]:
for i in cur:
    print(i)

(1, 'Puneet kumar', 5000000.0)
(2, 'Pawan', 20.0)
(3, 'Prabhat kumar', 50.0)
(4, 'Ajeet Kumar', 200.0)
(5, 'Deepak Kumar', 300.0)
(6, 'Anurag Nishad', 3000.0)
(7, 'Raj', 200000.0)
(10, 'sonu', None)
(11, None, None)
(12, None, None)
(13, None, None)
(14, None, None)
(16, 'Sunil', None)
(17, 'deepa', 100200.0)

In [94]:
cur.execute("desc countries")

In [95]:
for i in cur:
    print(i)

('country_id', b'varchar(20)', 'YES', '', None, '')
('country_name', b'varchar(20)', 'YES', '', None, '')
('region_id', b'float', 'YES', '', None, '')

In [ ]:
cur.execute("CREATE TABLE IF NOT EXISTS countries1 ( COUNTRY_ID varchar(2),COUNTRY_NAME varchar(40),REGION_ID decimal(10,0)")